Repository: shereenIbdah/SALIK_APP
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title
source: Salik
ar: سالك

# welcomeTitle
source: Welcome to Salik App
ar: مرحبًا بك في تطبيق سالك

# welcomeDescription
source: Explore and locate checkpoints easily on an interactive map for a seamless navigation experience.
ar: استكشف الحواجز بسهولة باستخدام الخريطة التفاعلية.

# statusTitle
source: Get Checkpoint Status
ar: تعرف على حالة الحواجز

# statusDescription
source: Stay updated with real-time checkpoint conditions to plan your route efficiently and avoid delays.
ar: تابع حالة الحواجز في الوقت الفعلي لتخطيط طريقك بكفاءة وتجنب التأخير.

# feedbackTitle
source: Give Feedback
ar: شارك حال الحواجز

# feedbackDescription
source: Share your input about checkpoint conditions to help others stay informed and improve route planning.
ar: ساهم في مساعدة الآخرين من خلال مشاركة حالة الحواجز.

# buttonContinue
source: Continue
ar: متابعة

source: Get Started
ar: البدء

# welcomeText
source: Welcome
ar: أهلا في سالك

# welcomeSubtitle
source: Discover the checkpoints and roads ahead!
ar: استكشف الحواجز القادمة وكن على دراية بالطرق!

# signUpButton
source: Sign Up
ar: إنشاء حساب

# signInButton
source: Sign In
ar: تسجيل الدخول

source: Continue as Guest
ar: الاستمرار كضيف

# loginTitle
source: Login to your account
ar: تسجيل الدخول إلى حسابك

# emailPhoneLabel
source: Email or Phone Number
ar: البريد الإلكتروني أو رقم الهاتف

# passwordLabel
source: Password
ar: كلمة المرور

# noAccountText
source: Don't have an account?
ar: ليس لديك حساب؟

# signUpLink
source: Sign up
ar: سجل الآن

# createAccount
source: Create Your Account
ar: أنشئ حسابك

source: Full Name
ar: الاسم الكامل

# emailPhone
source: Email or Phone Number
ar: البريد الإلكتروني أو رقم الهاتف

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

# selectCity
source: Select a city
ar: اختر المدينة

# frequentDriverQuestion
source: Are you a frequent driver?
ar: هل أنت سائق متكرر؟

source: Sign Up
ar: إنشاء حساب

# fullNameValidation
source: Please enter your full name
ar: يرجى إدخال اسمك الكامل

# emailValidation
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

# passwordValidation
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# confirmPasswordValidation
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

# passwordMismatchValidation
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# emailVerified
source: Your email has been verified!
ar: تم التحقق من بريدك الإلكتروني!

# checkEmail
source: Please check your email and click the verification link to complete the sign-up process.
ar: يرجى التحقق من بريدك الإلكتروني والنقر على رابط التحقق لإكمال عملية التسجيل.

# didNotReceiveEmail
source: Did not receive an email?
ar: لم تستلم البريد الإلكتروني؟

# resendCountdown
source: You can resend in: {countdown} seconds
ar: يمكنك إعادة الإرسال خلال: {countdown} ثانية

source: Resend
ar: إعادة الإرسال

# mapTitle
source: Interactive Map
ar: الخارطة التفاعلية

# unableToDetermineLocation
source: Unable to determine your location.
ar: لا يمكن تحديد موقعك.

# routingEnabledMessage
source: Routing enabled. Tap on the map to set your destination.
ar: تم تفعيل التوجيه. اضغط على الخريطة لتحديد وجهتك.

source: Search Checkpoint
ar: ابحث عن الحاجز

source: Enter checkpoint name
ar: أدخل اسم الحاجز

# enterValidName
source: Enter a valid name.
ar: أدخل اسمًا صالحًا.

# movedToCheckpoint
source: Moved to {checkpointName}
ar: تم الانتقال إلى {checkpointName}

source: Checkpoint not found.
ar: لم يتم العثور على الحاجز .

# showAllCheckpoints
source: Checkpoints
ar: عرض الحواجز

source: Route to Destination
ar: التوجيه إلى الوجهة

source: Your Place
ar: مكانك

source: Map Options
ar: خيارات الخريطة

# checkpoint
source: Checkpoint: {name}
ar: حاجز {name}

source: Cities and Checkpoints
ar: المدن والحواجز

source: Add Checkpoint
ar: إضافة حاجز

# contribute
source: Contribute to the App
ar: المساهمة في التطبيق

source: Accident Reports
ar: تقارير الحوادث

source: Accident News
ar: اخبار الحوادث

source: Profile
ar: الملف الشخصي

source: Logout
ar: تسجيل الخروج

# searchForCityOrChckpoint
source: Search for a city or checkpoint
ar: ابحث عن مدينة أو حاجز

# addNewCheckpoint
source: Adding new checkpoint
ar: إضافة حاجز جديد

source: Checkpoint Name
ar: اسم الحاجز

source: Latitude
ar: خط العرض

source: Longitude
ar: خط الطول

source: Status
ar: الحالة

# checkpointAdded
source: New checkpoint added and associated with {city}
ar: تمت إضافة حاجز جديد وربطه بـ {city}

# contributeTitle
source: Contribute to the App
ar: المساهمة في التطبيق

# suggestIdea
source: Suggest an Idea
ar: اقترح فكرة جديدة

# reportAccident
source: Report an accident in a specific city
ar: التبليغ عن حادث في منطقة معينة

source: Approve
ar: قبول

source: Delete
ar: حذف

source: Change Password
ar: تغيير كلمة المرور

# activeNotifications
source: Active Notifications fot city
ar: تفعيل الاشعارات لمدينة معينة

source: Location Permission
ar: إذن الموقع

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

# confirmPasswordText
source: Confirm Password
ar: تأكيد كلمة المرور

# logoutConfirmationTitle
source: Confirm Logout
ar: تأكيد تسجيل الخروج

# logoutConfirmationMessage
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

source: Yes
ar: نعم

# logoutError
source: An error occurred while logging out: {error}
ar: حدث خطأ أثناء تسجيل الخروج: {error}

# guideTitle
source: How to Use Salik
ar: دليل الاستخدام

source: End
ar: إنهاء

# pleaseSelectCity
source: Please select a city
ar: يرجى اختيار مدينة

# checkpointBetweenCities
source: Checkpoints between two cities
ar: الحواجز بين مدينتين

# selectCityToExit
source: Select the city you will exit from
ar: اختر المدينة التي ستخرج منها

source: Adapted city
ar: المدينة المنطلقة

# selectCityToEnter
source: Select the city you will go to
ar: اختر المدينة التي ستذهب إليها

source: Destination city
ar: المدينة الوجهة

source: Display Checkpoints
ar: عرض الحواجز

source: City-to-City Checkpoints
ar: الحواجز بين المدن

# checkpointAddedByUser
source: Checkpoints Added by User
ar: الحواجز المضافة من قبل المستخدم

source: User Suggestions
ar: اقتراحات المستخدم

# errorOccurred
source: An error occurred! Please try again.
ar: حدث خطأ! حاول مرة أخرى.

source: No data available.
ar: لا توجد بيانات متاحة.

source: Description
ar: الوصف

# ReportedAt
source: Reported from
ar: تم الإبلاغ عنه منذ :

# userReport
source: Community Submissions
ar: اقتراحات وبلاغات

# accidentReportss
source: Accident Reports
ar: الحوادث المبلغ عنها

source: Feedbacks History
ar: سجل المشاركات

source: Set Destination
ar: عين وجهتك

# destinationConfirmation
source: Do you want to set this location as your destination?
ar: هل تريد تعيين هذا الموقع كوجهتك؟

source: Get Route
ar: احصل على المسار

source: Remove Marker
ar: إزالة العلامة

# pressoncity
source: Press on the city name to view the checkpoints within its range
ar: اضغط على اسم المدينة لعرض الحواجز ضمن نطاقها

source: Best Way
ar: الطريق الأمثل

source: Another Way
ar: طريق أخرى

# wait
source: This process takes some time, please wait...
ar: هذه العملية تأخذ بعض الوقت، يرجى الانتظار...

# searchByName
source: Search by checkpoint name
ar: أكتب اسم الحاجز للبحث

# checkpointInfo
source: Checkpoint information
ar: معلومات الحاجز

source: Idea Name
ar: إسم الفكرة

# enterIdeaName
source: Enter the idea name
ar: أدخل اسم الفكرة

# enterdescription
source: Enter a description
ar: أكتب وصف للفكرة

source: Submit Idea
ar: أرسال الفكرة

source: Salik Statistics
ar: إحصائيات سالك

# reports
source: Salik statistics and news
ar: إحصائيات وأخبار سالك

source: Total number of checkpoints
ar: عدد الحواجز الكلي:

# numOfCheclpointsInCity
source: Number of checkpoints in your city
ar: عدد الحواجز في مدينتك

# nearestCheckpoints
source: Nearest checpoints
ar: الحواجز الأقرب اليك

# lastNews
source: Latest news about accidents:
ar: أخر أخبار الحوادث
